---
kind: other
id: Methods.T:Autodesk.Revit.DB.Architecture.StairsLandingType
source: html/07103511-fe3d-26c5-6870-d021c769ef35.htm
---
# StairsLandingType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.